
[exportbulkcontentcommandlet]
helpcmd=ExportBulkContentCommandlet
helponeliner=Exportar grueso de datos de todos los objetos que residen en el paquete especificado.
helpusage=ExportMips

[exportstreaminglevelbulkcontentcommandlet]
helpcmd=ExportStreamingLevelBulkContentCommandlet
helponeliner=Exportar los mips de todas las texturas en todos los paquetes de texturas.
helpusage=ExportMips

[exporttexturemipscommandlet]
helpcmd=ExportMipsCommandlet
helponeliner=Exportar los mips de todas las texturas en todos los paquetes de texturas.
helpusage=ExportMips

[execmacrocommandlet]
helpcmd=ejecmacro
helponeliner=Ejecutar un archivo editor macro de script.
helpusage=ejecmacro archivoscript
helpparm[0]=Nombre de archivo del script a ejecutar. Ojo, TIENE que ser un script no específico del nivel, como crear nuevas fuentes.

[compressnormalmapscommandlet]
helpcmd=comprimirmapasnormales
helponeliner=Comprimir mapas normales en paquetes a un formato específico
helpusage=comprimirmapasnormales enformato=INFMT outformat=OUTFMT packages=WILDCARD <verbose=[true|false]>
helpparm[0]=INFMT
helpdesc[0]=Formato original de mapas normales que deberían comprimirse; tiene que ser uno de [any|rgba8|cxv8u8|dxt5n]
helpparm[0]=INFMT
helpdesc[0]=Formato original de mapas normales que deberían comprimirse; tiene que ser uno de [any|rgba8|cxv8u8|dxt5n]
helpparm[0]=INFMT
helpdesc[0]=Formato original de mapas normales que deberían comprimirse; tiene que ser uno de [any|rgba8|cxv8u8|dxt5n]

[rebuildmoppscommandlet]
helpcmd=rebuildmopps
helponeliner=Reconstruir el MOPP de Havok de uno o más mapas
helpusage=rebuildmopp Map_A Map_B ... Map_Last
helpparm[0]=Nombre del mapa para el que debería reconstruirse el MOPP

[updateassetcatalogcommandlet]
helpcmd=updateassetcatalog
helponeliner=Actualizar el catálogo de activos con respecto al paquete de activos especificado
helpusage=updateassetcatalog [ {package} | "create" | "dump" ]
helpparm[0]=Nombre del paquete que ha cambiado (o "create" para crear un nuevo catálogo de activos, o "dump" para volcar los contenidos del catálogo)

[mastercommandlet]
helpcmd=master
helponeliner=Crear archivos máster del instalador
helpusage=master [-opción...] [parm=valor]...
helpparm[0]=MasterPath
helpdesc[0]=Directorio raíz del que copiar archivos fuente
helpparm[1]=srcpath
helpdesc[1]=Directorio raíz al que copiar archivos fuente (publicación)
helpparm[2]=RefPath
helpdesc[2]=Ruta de referencia de ruta de compresión delta

[mapconvertcommandlet]
helpcmd=convertirmapa
helponeliner=Convierte mapas del formato antiguo al nuevo (sin transformaciones de pincel)
helpusage=convertirmapa SrcFilename DstFilename
helpparm[0]=SrcFilename
helpdesc[0]=Nombre de archivo de mapa del que leer
helpparm[1]=DstFilename
helpdesc[1]=Nombre de archivo de mapa en el que escribir

[conformcommandlet]
helpcmd=ajustar
helponeliner=Generar archivos binarios ajustados
helpusage=ajustar archivo_existente.ext archivo_antiguo.ext
helpparm[0]=archivoexistente.ext
helpdesc[0]=Archivo binario existente para cargar, ajustar y guardar
helpparm[1]=archivoantiguo.ext
helpdesc[1]=Archivo antiguo con el que hacer compatible código de archivo fuente

[pkgcommandlet]
helpcmd=pkg
helponeliner=Importa/Exporta datos a/de paquetes usando estructuras de directorio.
helpusage=pkg [importar/exportar] [textura/sonido] [nombrepaquete] [directorio]
helpparm[0]=importar/exportar
helpdesc[0]=Lo que intentas hacer con los datos
helpparm[1]=textura/sonido
helpdesc[1]=Tipo de paquete con el que trabajas
helpparm[2]=nombrepaquete
helpdesc[2]=Paquete del que estás creando/exportando
helpparm[3]=directorio
helpdesc[3]=Directorio a leer/escribir

[packageflagcommandlet]
helpcmd=packageflag
helponeliner=Establecer marcadores de paquete en archivos de paquete
helpusage=packageflag src.ext [dest.ext <+|->marcador [<+|->marcador] ...]
helpparm[0]=src.ext
helpdesc[0]=Archivo paquete existente a cargar
helpparm[1]=dest.exe
helpdesc[1]=Nombre de nuevo archivo paquete con nuevas configuraciones de marcadores
helpparm[2]=marcador
helpdesc[2]=+ para poner un marcador, o - para quitar un marcador, seguido de uno de:
helpparm[3]=" "
helpdesc[3]="  PermitirDescarga"
helpparm[4]=" "
helpdesc[4]="  ClienteOpcional"
helpparm[5]=" "
helpdesc[5]="  SoloLadoServidor"
helpparm[6]=" "
helpdesc[6]="  EnlacesNoVálidos"
helpparm[7]=" "
helpdesc[7]="  NoSeguro"

[makecommandlet]
helpcmd=hacer
helponeliner=Reconstruir paquetes de UnrealScript
helpusage=hacer [-option...] [parm=value]...
helpparm[0]=Silencioso
helpdesc[0]=Sin preguntar; "sí" a todas las preguntas
helpparm[1]=NoAsignado
helpdesc[1]=No forzar asignación de funciones nativas a DLL
helpparm[2]=Todo
helpdesc[2]=Reconstrucción limpia (de lo contrario la reconstrucción se va incrementando)

[dxtconvertcommandlet]
helpcmd=dxtconvert
helponeliner=Convertir texturas DXT3/5 en DXT1/ RGBA
helpusage=dxtconvert srcpath destpath
helpparm[0]=srcpath
helpdesc[0]=Ruta que contiene archivos fuente
helpparm[1]=destpath
helpdesc[1]=Ruta de archivos de destino


[analyzecontentcommandlet]
helpcmd=analizarcontenido
helponeliner=Analiza mapa
helpusage=analizarcontenido nombremapa
helpparm[0]=nombremapa
helpdesc[0]=Ruta a archivo de mapa


[batchexportcommandlet]
helpcmd=exportaciónlote
helponeliner=Exportar objetos en grandes cantidades
helpusage=exportaciónlote paquete.ext nombreclase exportar_ext
helpparm[0]=paquete.ext
helpdesc[0]=Paquete cuyos objetos quieres exportar
helpparm[1]=nombreclase
helpdesc[1]=Clase de objetos para exportar
helpparm[2]=exportar_ext
helpdesc[2]=Extensión de archivo al que exportar
helpparm[3]=ruta
helpdesc[3]=Ruta para exportar archivos, como c:\MiRuta

[dataripcommandlet]
helpcmd=datarip
helponeliner=Crear un paquete con datos de texturas, música y sonido extraídos.
helpusage=datarip srcpackage.ext dstpackage.ext
helpparm[0]=srcpackage.ext
helpdesc[0]=Paquete fuente
helpparm[1]=dstpackage.ext
helpdesc[1]=Paquete destino

[buildaudiocommandlet]
helpcmd=crearaudio
helponeliner=Crear paquetes de sonido a partir de archivos de sonido
helpusage=crearaudio NombrePaquete=PKGNAME BloqueSonidoNuevoContenido=FILENAME [UsarDirectorioPruebaSonido=(0|1)]=PKGNAME SoundBlockNewContents=FILENAME [UseTestSoundDirectory=(0|1)]
helpparm[0]=PKGNAME
helpdesc[0]=Nombre del paquete para crear (menos la extensión de archivo)
helpparm[1]=FILENAME
helpdesc[1]=Ruta completa del archivo ini que recoge los archivos de sonido que componen este paquete
